#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** TODO [#A] Basic Setup [3/7]
:LOGBOOK:
CLOCK: [2023-11-11 Sat 01:05]
CLOCK: [2023-11-11 Sat 00:51]--[2023-11-11 Sat 01:05] =>  0:14
CLOCK: [2023-11-10 Fri 23:06]--[2023-11-11 Sat 00:47] =>  1:41
CLOCK: [2023-11-10 Fri 21:42]--[2023-11-10 Fri 22:48] =>  1:06
CLOCK: [2023-11-10 Fri 21:20]--[2023-11-10 Fri 21:26] =>  0:06
CLOCK: [2023-11-10 Fri 20:45]--[2023-11-10 Fri 21:16] =>  0:31
CLOCK: [2023-11-10 Fri 19:36]--[2023-11-10 Fri 20:13] =>  0:37
CLOCK: [2023-11-10 Fri 11:52]--[2023-11-10 Fri 12:38] =>  0:46
CLOCK: [2023-11-10 Fri 11:40]--[2023-11-10 Fri 11:47] =>  0:07
CLOCK: [2023-11-10 Fri 10:53]--[2023-11-10 Fri 11:24] =>  0:31
CLOCK: [2023-11-10 Fri 10:24]--[2023-11-10 Fri 10:44] =>  0:20
CLOCK: [2023-11-10 Fri 09:22]--[2023-11-10 Fri 10:17] =>  0:55
CLOCK: [2023-11-10 Fri 08:39]--[2023-11-10 Fri 09:20] =>  0:41
CLOCK: [2023-11-10 Fri 08:32]--[2023-11-10 Fri 08:39] =>  0:07
CLOCK: [2023-11-09 Thu 09:44]--[2023-11-09 Thu 09:59] =>  0:15
CLOCK: [2023-11-09 Thu 07:53]--[2023-11-09 Thu 08:06] =>  0:13
CLOCK: [2023-11-08 Wed 22:27]--[2023-11-08 Wed 23:09] =>  0:42
CLOCK: [2023-11-08 Wed 22:16]--[2023-11-08 Wed 22:18] =>  0:02
CLOCK: [2023-11-08 Wed 21:25]--[2023-11-08 Wed 21:45] =>  0:20
CLOCK: [2023-11-08 Wed 20:22]--[2023-11-08 Wed 20:48] =>  0:26
CLOCK: [2023-11-08 Wed 20:08]--[2023-11-08 Wed 20:17] =>  0:09
CLOCK: [2023-11-08 Wed 19:25]--[2023-11-08 Wed 20:03] =>  0:38
CLOCK: [2023-11-08 Wed 18:29]--[2023-11-08 Wed 19:15] =>  0:46
CLOCK: [2023-11-08 Wed 17:42]--[2023-11-08 Wed 18:10] =>  0:28
CLOCK: [2023-11-08 Wed 16:33]--[2023-11-08 Wed 17:02] =>  0:29
CLOCK: [2023-11-08 Wed 11:31]--[2023-11-08 Wed 12:13] =>  0:42
CLOCK: [2023-11-08 Wed 09:21]--[2023-11-08 Wed 10:58] =>  1:37
CLOCK: [2023-11-08 Wed 09:02]--[2023-11-08 Wed 09:11] =>  0:09
CLOCK: [2023-11-08 Wed 08:44]--[2023-11-08 Wed 08:52] =>  0:08
CLOCK: [2023-11-08 Wed 07:55]--[2023-11-08 Wed 08:41] =>  0:46
CLOCK: [2023-11-08 Wed 07:01]--[2023-11-08 Wed 07:52] =>  0:51
CLOCK: [2023-11-07 Tue 18:01]--[2023-11-07 Tue 20:07] =>  2:06
CLOCK: [2023-11-07 Tue 17:17]--[2023-11-07 Tue 17:58] =>  0:41
CLOCK: [2023-11-07 Tue 16:24]--[2023-11-07 Tue 16:49] =>  0:25
CLOCK: [2023-11-07 Tue 11:43]--[2023-11-07 Tue 11:58] =>  0:15
CLOCK: [2023-11-07 Tue 11:22]--[2023-11-07 Tue 11:40] =>  0:18
CLOCK: [2023-11-07 Tue 10:48]--[2023-11-07 Tue 11:12] =>  0:24
CLOCK: [2023-11-07 Tue 10:15]--[2023-11-07 Tue 10:43] =>  0:28
CLOCK: [2023-11-07 Tue 09:46]--[2023-11-07 Tue 10:03] =>  0:17
CLOCK: [2023-11-07 Tue 09:20]--[2023-11-07 Tue 09:43] =>  0:23
CLOCK: [2023-11-07 Tue 08:02]--[2023-11-07 Tue 08:33] =>  0:31
CLOCK: [2023-11-07 Tue 07:01]--[2023-11-07 Tue 07:21] =>  0:20
CLOCK: [2023-11-06 Mon 22:14]--[2023-11-06 Mon 22:36] =>  0:22
CLOCK: [2023-11-06 Mon 21:35]--[2023-11-06 Mon 22:06] =>  0:31
CLOCK: [2023-11-06 Mon 21:25]--[2023-11-06 Mon 21:34] =>  0:09
:END:
- [X] Chunk Menu Card down in small sizeable chunks of work
- [X] [#C] reorg docs [6/6]
  - [X] initialise vitepress
    - [X] added config
    - [X] add index.md
    - [X] add .gitignore
    - [X] add markdown checkmark support
  - [X] add Joruney Folder
  - [X] add Monday.md
  - [X] add to config
  - [X] deploy on key3d.surge.sh
  - [X] write emails
- [X] [#C] Add Backend [4/4]
  - [X] Decide Deno or Rust, Deno is the winner
  - [X] SideQuest
    - [X] PBA Answering Mail
    - [X] Going to BMW Production (Day off)
    - [X] Write Thursday.md
  - [X] add journey deno deploy [5/5]
    - [X] add basics
    - [X] Projects thingies
    - [X] Organ Thingies
    - [X] connect to db [5/5]
      - [X] kv
      - [X] dynamoDB
      - [X] FaunaDB
      - [X] Firebase
      - [X] Postgres [7/7]
        - [X] set up local psql
        - [X] add table
        - [X] insert data
        - [X] display local data
        - [X] rewrite it to deno deploy
        - [X] make an api
        - [X] write bash script to test it
    - [X] SideQuest[1/1]
      - [X] check exam
  - [X] Add some sort of Backend API just in case
    - [X] serve stupid json via Deno
      - [X] add oak
      - [X] serve something
      - [X] add routes
      - [X] change to products
      - [X] add post
      - [X] safe in memory
    - [X] add postgress [9/9]
      - [X] connect
      - [X] get value
      - [X] on init set values
      - [X] get value by id
      - [X] add update value
      - [X] add migrations
      - [X] reshuffle project
      - [X] add more migrations
      - [X] complete crud ops
    - [X] update .gitattriubes to detect .ts
    - [X] add minimal working tests
    - [X] write Friday.md
- [-] [#A] Add Smart Contract [11/12]
  - [X] intilaise foundry
  - [X] init playground foundry [23/23]
    - [X] add Basics
    - [X] set up Code Editor for foundry
    - [X] add test
    - [X] add writing tests
    - [X] add cheatcode
    - [X] add forge standard library
    - [X] add traces
    - [X] add fork testing
    - [X] add advanced Testing
      - [X] fuzz testing
      - [X] Invariant Testing
        - [X] read that thing
        - [X] code it
    - [X] add advanced Testing
      - [X] Differential Testing
    - [X] deplying and verify
    - [X] gas tracking
      - [X] gas reports
      - [X] gas snapshots
    - [X] debugger
    - [X] cast
    - [X] Anvil
    - [X] chisel
    - [X] config
    - [X] ci
    - [X] in vs code
    - [X] shell auto
    - [X] static anazlyer
    - [X] integrate hardhat
    - [X] best practices
  - [X] side quest vali[4/4]
    - [X] Dach Call
    - [X] Vali with saro check
    - [X] recompile polka for vali -.-'
    - [X] Vali thing agains, fix telemetry
  - [X] side quest docs[5/5]
    - [X] Write Tuesday.md
    - [X] config index.md
    - [X] add favicon.ico
    - [X] redeploy
    - [X] Write Wednesday.md
  - [X] Scratch a stupid contract out
  - [X] Test it somewhere ( Remix, local,  )
  - [X] Call it somehow
  - [X] loop the calling
  - [X] Deploy it sucessfully somewhere
  - [X] Deploy it on Sepolia and verify via etherscan
    - [[https://sepolia.etherscan.io/address/0x5aa0b5ee61195075df5626244533838d32a097ba#code][Contract Verification]]
  - [-] Deploy it on zk Astar [1/3]
    - [X] Wrote [[https://ethereum.stackexchange.com/questions/156282/foundry-astar-zkevm-deployment][Ethereum Stack Exchange Issue]]
    - [ ] verify it
    - [ ] Get something running on zkEVM
  - [X] Decide to Stick to Sepolia
- [ ] [#A] Rough Frontend [0/12]
  - [ ] Display something on page
  - [ ] Add ethers
  - [ ] Connect to a chain via ethers
  - [ ] Get Blocknumber via ethers
  - [ ] Display Blocknumber
  - [ ] Display Blocknumber subscribely
  - [ ] Get Something from Contract
  - [ ] Display something from Contract
  - [ ] Call smart contract via ehterscan?!?
  - [ ] Call Smart Contract via ethers
  - [ ] Add button, call on Button Click
  - [ ] Declare vicotry for now
- [ ] [#C] Get a 3D Model of Ramen from somwhere[0/0]
- [ ] [#C] UI/UX [0/1]
  - [ ] Check Figma, add cleanup if necessary
